<a href="https://colab.research.google.com/github/pcorfer/didactic-adventure/blob/main/Preguntas_Frecuentes_y_algunos_comentarios.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Como dejar una columna como indice**
más info (en español): https://www.delftstack.com/es/howto/python-pandas/set-column-as-index-pandas/

In [ ]:
import pandas as pd

data={'Columna1':[5,3,7,4],'Columna2':['a','b','c','d'],'ID':[1,2,3,4]}
df1 = pd.DataFrame(data)
df1.head()

   Columna1 Columna2  ID
0         5        a   1
1         3        b   2
2         7        c   3
3         4        d   4

In [ ]:
df1.set_index('ID', inplace = True) #inplace=True sobreescribe la variable df1
df1.head()

    Columna1 Columna2
ID
1          5        a
2          3        b
3          7        c
4          4        d

# **Como borrar una fila o columna**

Supongamos que tenemos lo siguiente:

In [ ]:
import pandas as pd
df2=pd.read_csv("Nombre_Archivo.csv" , delimiter=",") #si el archivo está en la misma carpeta no es necesario incluir ruta

df2.drop("Nombre_Columna/Indice_Fila", axis = 1 para columnas 0 para filas)

Referencia: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html

#Esta celda es solo un ejemplo, no va a correr porque los nombres son ficticios.

Ejemplo en dataset vgsales.csv

In [ ]:
import pandas as pd

ruta='https://raw.githubusercontent.com/pcorfer/didactic-adventure/main/vgsales.csv'  #dirección del archivo con el nombre.csv
df2=pd.read_csv(ruta)

In [ ]:
df2.head(4) #revisamos que esten cargados los datos. Todo OK

   Rank               Name Platform  ...  Global_Sales Unnamed: 12 Unnamed: 13
0     1         Wii Sports      Wii  ...         82,74         NaN         NaN
1     2  Super Mario Bros.      NES  ...         40,24         NaN         NaN
2     3     Mario Kart Wii      Wii  ...         35,82         NaN         NaN
3     4  Wii Sports Resort      Wii  ...            33         NaN         NaN

[4 rows x 14 columns]

In [ ]:
#Vamos a eliminar la tercera fila (2 en el indice por 0, 1 y [2])
df2.drop(index=2,axis=0,inplace=True) #le dije que eliminara la fila (por eso axis=0) y le indiqué el indice de la fila (index=2) 
#y el inplace=True es para que se sobreescriba la variable df
df2.head(4) #Veamos si se eliminó la fila que debiese contener al Mario Kart Wii

   Rank                      Name  ... Unnamed: 12  Unnamed: 13
0     1                Wii Sports  ...         NaN          NaN
1     2         Super Mario Bros.  ...         NaN          NaN
3     4         Wii Sports Resort  ...         NaN          NaN
4     5  Pokemon Red/Pokemon Blue  ...         NaN          NaN

[4 rows x 14 columns]

Ahora, eliminando una columna:

In [ ]:
df2.drop(labels=["Unnamed: 12","Unnamed: 13"], axis = 1, inplace=True) # en el parámetro labels les das el nombre de la columna.
#Si son más de una las pones en una lista.
#Aquí indicamos axis = 1 porque queremos que borre Columnas.

In [ ]:
df2.head(2) #Tada!

   Rank               Name Platform  ...  JP_Sales Other_Sales Global_Sales
0     1         Wii Sports      Wii  ...      3,77        8,46        82,74
1     2  Super Mario Bros.      NES  ...      6,81        0,77        40,24

[2 rows x 12 columns]

Ahora lo importante, si queremos eliminar columnas que cumplan cierta condición:
Referencias: https://code.i-harness.com/es/q/1154bb3

(Original en inglés) https://stackoverflow.com/questions/18172851/deleting-dataframe-row-in-pandas-based-on-column-value

In [ ]:
# Vamos a eliminar todas filas que tengan la plataforma "Wii"
# Primero vamos a ver cuantos "Wii" hay
df2["Platform"].value_counts() #Hay 767. El método .value_counts() cuenta cuantas veces se repiten los valores que contiene la columna.

PS2     1329
PS3      882
X360     845
DS       823
Wii      766
PS       749
GBA      422
PSP      410
XB       382
GC       264
PC       254
N64      231
3DS      217
PS4      195
SNES     175
XOne     127
2600     126
PSV      106
NES       95
GB        88
WiiU      81
SAT       68
DC        22
GEN       13
WS         5
NG         4
SCD        1
Name: Platform, dtype: int64

In [ ]:
#Ahora para borrar con una condición le indicamos lo siguiente:
df2 = df2[df2["Platform"]!="Wii"]  #Es decir, guardar todo EXCEPTO (!=) lo que en la columna Platform sea "Wii". PD: Funciona con números también ;)
df2.head()

   Rank                      Name Platform  ...  JP_Sales Other_Sales Global_Sales
1     2         Super Mario Bros.      NES  ...      6,81        0,77        40,24
4     5  Pokemon Red/Pokemon Blue       GB  ...     10,22           1        31,37
5     6                    Tetris       GB  ...      4,22        0,58        30,26
6     7     New Super Mario Bros.       DS  ...       6,5         2,9        30,01
9    10                 Duck Hunt      NES  ...      0,28        0,47        28,31

[5 rows x 12 columns]

In [ ]:
df2["Platform"].value_counts() # NO HAY Wii :D Tada!

PS2     1329
PS3      882
X360     845
DS       823
PS       749
GBA      422
PSP      410
XB       382
GC       264
PC       254
N64      231
3DS      217
PS4      195
SNES     175
XOne     127
2600     126
PSV      106
NES       95
GB        88
WiiU      81
SAT       68
DC        22
GEN       13
WS         5
NG         4
SCD        1
Name: Platform, dtype: int64

Si tienen valores NaN, df.dropna() les podría servir.
Otra cosa, recuerden que pueden jugar con los valores, es decir, si tienen valores que no correspondan o que les estorben, pueden **reemplazarlos**, eliminarlos, reemplazarlos y eliminarlos, cortar strings, etc :)
Ánimo y cualquier cosa pregunten! :D

# **Como reemplazar valores en las columnas**

In [ ]:
import pandas as pd

data={"Columna1":[1,2,3,4,5], "Columna2":['a','b','c','d','e'],"Columna3":['3,2','1.4','2,5pk','"d"','0,1']}
df3 = pd.DataFrame(data)
df3.set_index("Columna1", inplace=True) # df3 = df3.set_index("Columna1") son equivalentes

df3.head()

         Columna2 Columna3
Columna1
1               a      3,2
2               b      1.4
3               c    2,5pk
4               d      "d"
5               e      0,1

Supongamos que la columna3 debiese tener solo valores de tipo float pero vemos que "Columna3" es un revoltijo de datos.

Vamos a "curar" los datos para que podamos procesarlos.

In [ ]:
#Primero unas observaciones
df3.info() #revisemos los datos
#independiente por donde partamos hay que trabajar practicamente en todos
#porque si bien el 1.4 de la 2da fila tiene la notación correcta de un float
#no tiene el tipo float asignado.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Columna2  5 non-null      object
 1   Columna3  5 non-null      object
dtypes: object(2)
memory usage: 120.0+ bytes

In [ ]:
#Empecemos por corregir la notación. Un float debe tener un punto como separador de decimales.
#Los valores que no tienen el punto por separador son el 3,2 y el 0,1
df3["Columna3"] = df3["Columna3"].str.replace(",",".") #Pasa por todos los str de la columna
#y donde encuentre el valor (",") lo reemplazará por el valor (".")

#ref: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.replace.html

In [ ]:
df3.head()

         Columna2 Columna3
Columna1
1               a      3.2
2               b      1.4
3               c    2.5pk
4               d      "d"
5               e      0.1

In [ ]:
#Ahora corregiremos el valor 2.5pk
df3["Columna3"] = df3["Columna3"].str.strip('pk') #Con strip removemos los caracteres indicados.
df3.head()

#ref: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.strip.html

         Columna2 Columna3
Columna1
1               a      3.2
2               b      1.4
3               c      2.5
4               d      "d"
5               e      0.1

In [ ]:
x='3.2'
a=float(x)
type(a)

float

In [ ]:
# Por ultimo  tenemos un valor string ("d") que no es valido para nuestra columna que solo debería tener floats.
# Como lo único que hace ese valor erroneo es estorbar, eliminaremos la fila entera para conservar las dimensiones del dataframe.
df3 = df3[df3["Columna3"].str.contains("d") == False] #y así guardo todos los valores donde NO SALGA el string "d"
#ref: https://www.statology.org/pandas-drop-rows-that-contain-string/

In [ ]:
df3.head()

         Columna2 Columna3
Columna1
1               a      3.2
2               b      1.4
3               c      2.5
5               e      0.1

Ahora solo queda transfomar el tipo de dato a los correspondientes. Observemos que:

Para la columna 2 dado que son letras y las letras son limitadas y fijas, concluimos que es de tipo categórica (variable categórica nominal).

Para la columna 3 dado que son números es una variable numérica y como es float puede tomar infinitos valores entre vecinos, por lo que sería una variable numérica continua.

Si fuesen numeros enteros sería una variable numérica discreta (Ej. como los dedos de una mano, los autos de una familia, la cantidad de embarazos).

ref: https://www.lifeder.com/variable-discreta/

http://www.corladpuno.org.pe/manuel.anchapuri/guia-para-el-manejo-de-variables-en-la-investigacion/

In [ ]:
df3["Columna2"] = df3["Columna2"].astype('category')
df3["Columna3"] = df3["Columna3"].astype('float')

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Columna2  4 non-null      category
 1   Columna3  4 non-null      float64
dtypes: category(1), float64(1)
memory usage: 260.0 bytes

# Gráficando con el ayudante (próximamente)